---
kind: method
id: M:Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.Dispose
source: html/63769f47-3fb9-cabb-d62a-46e56bf9dd43.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.Dispose Method

Releases all resources used by the AreaBasedLoadBoundaryLineData

## Syntax (C#)
```csharp
public void Dispose()
```